# **Northwind database:**

## Part B) Queries

In [1]:
%load_ext sql

In [2]:
host = 'localhost'
database = 'Northwind'
user = 'ali'
password = 'ali'
connection_string = f'postgresql://{user}:{password}@{host}/{database}'

%sql $connection_string

/home/aliiz/dsenv/lib/python3.7/site-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

### 1) تعداد کارمندان در هر منطقه

In [8]:
%%sql
SELECT count(employees.employee_id), region.region_description
FROM employees
INNER JOIN employee_territories
ON employees.employee_id = employee_territories.employee_id
INNER JOIN territories
ON employee_territories.territory_id = territories.territory_id
INNER JOIN region
ON territories.region_id = region.region_id
group by region.region_id

 * postgresql://ali:***@localhost/Northwind
4 rows affected.

[(19, 'Eastern'), (11, 'Northern'), (15, 'Western'), (4, 'Southern')]

### 2) نواحی هر منطقه

In [10]:
%%sql
SELECT region.region_description, territories.territory_description
from territories
INNER JOIN region
ON territories.region_id = region.region_id
order by region.region_description

 * postgresql://ali:***@localhost/Northwind
53 rows affected.

[('Eastern', 'New York'),
 ('Eastern', 'Bedford'),
 ('Eastern', 'Georgetow'),
 ('Eastern', 'Boston'),
 ('Eastern', 'Cambridge'),
 ('Eastern', 'Braintree'),
 ('Eastern', 'Providence'),
 ('Eastern', 'Wilton'),
 ('Eastern', 'Morristown'),
 ('Eastern', 'Edison'),
 ('Eastern', 'Westboro'),
 ('Eastern', 'New York'),
 ('Eastern', 'Mellvile'),
 ('Eastern', 'Fairport'),
 ('Eastern', 'Neward'),
 ('Eastern', 'Rockville'),
 ('Eastern', 'Greensboro'),
 ('Eastern', 'Cary'),
 ('Eastern', 'Louisville'),
 ('Northern', 'Bloomfield Hills'),
 ('Northern', 'Philadelphia'),
 ('Northern', 'Racine'),
 ('Northern', 'Roseville'),
 ('Northern', 'Minneapolis'),
 ('Northern', 'Hollis'),
 ('Northern', 'Portsmouth'),
 ('Northern', 'Beachwood'),
 ('Northern', 'Findlay'),
 ('Northern', 'Southfield'),
 ('Northern', 'Troy'),
 ('Southern', 'Bentonville'),
 ('Southern', 'Austin'),
 ('Southern', 'Orlando'),
 ('Southern', 'Tampa'),
 ('Southern', 'Columbia'),
 ('Southern', 'Atlanta'),
 ('Southern', 'Savannah'),
 ('Southern', 'Dallas'),
 ('Western', 'Santa Cruz'),
 ('Western', 'Redmond'),
 ('Western', 'Seattle'),
 ('Western', 'Hoffman Estates'),
 ('Western', 'Chicago'),
 ('Western', 'Denver'),
 ('Western', 'Colorado Springs'),
 ('Western', 'Phoenix'),
 ('Western', 'Scottsdale'),
 ('Western', 'Santa Monica'),
 ('Western', 'Menlo Park'),
 ('Western', 'San Francisco'),
 ('Western', 'Campbell'),
 ('Western', 'Santa Clara'),
 ('Western', 'Bellevue')]

### 3) نام و نام خانوادگی کارمندان شیکاگو

In [13]:
%%sql
SELECT employees.first_name, employees.last_name
FROM employees
INNER JOIN employee_territories
ON employees.employee_id = employee_territories.employee_id
INNER JOIN territories
ON employee_territories.territory_id = territories.territory_id
where territories.territory_description = 'Chicago'

 * postgresql://ali:***@localhost/Northwind
1 rows affected.

[('Robert', 'King')]

### 4) محصولات کمتر از حد مجاز

In [15]:
%%sql
select product_name, reorder_level, units_in_stock from products
where (discontinued = 0) and (reorder_level > units_in_stock)
order by units_in_stock asc

 * postgresql://ali:***@localhost/Northwind
17 rows affected.

[('Gorgonzola Telino', 20, 0),
 ("Sir Rodney's Scones", 5, 3),
 ('Longlife Tofu', 5, 4),
 ('Louisiana Hot Spiced Okra', 20, 4),
 ('Rogede sild', 15, 5),
 ('Scottish Longbreads', 15, 6),
 ('Mascarpone Fabioli', 25, 9),
 ('Nord-Ost Matjeshering', 15, 10),
 ('Maxilaku', 15, 10),
 ('Gravad lax', 25, 11),
 ('Aniseed Syrup', 25, 13),
 ('Chocolade', 25, 15),
 ('Outback Lager', 30, 15),
 ('Ipoh Coffee', 25, 17),
 ('Gnocchi di nonna Alice', 30, 21),
 ('Wimmers gute Semmelknödel', 30, 22),
 ('Queso Cabrales', 30, 22)]

### 5) بیشترین سفارش محصول در ماه اخیر

In [22]:
%%sql
select products.product_name, count(order_details.product_id) as order_count
from products
INNER JOIN order_details
ON products.product_id = order_details.product_id
INNER JOIN orders
ON order_details.order_id = orders.order_id
where orders.shipped_date between '1998-04-06' and '1998-05-06'
group by products.product_name
order by order_count desc
limit 2

 * postgresql://ali:***@localhost/Northwind
2 rows affected.

[('Guaraná Fantástica', 8), ("Jack's New England Clam Chowder", 8)]

### 6) مشتریان بدون فکس

In [23]:
%%sql
select contact_name from customers
where fax is null

 * postgresql://ali:***@localhost/Northwind
22 rows affected.

[('Antonio Moreno',),
 ('Victoria Ashworth',),
 ('Yang Wang',),
 ('Pedro Afonso',),
 ('Aria Cruz',),
 ('Maria Larsson',),
 ('José Pedro Freyre',),
 ('André Fonseca',),
 ('Howard Snyder',),
 ('Helen Bennett',),
 ('Philip Cramer',),
 ('Jaime Yorres',),
 ('Alexander Feuer',),
 ('Isabel de Castro',),
 ('Lúcia Carvalho',),
 ('Horst Kloss',),
 ('Janete Limeira',),
 ('Michael Holz',),
 ('Jose Pavarotti',),
 ('Liz Nixon',),
 ('Miguel Angel Paolino',),
 ('Paula Parente',)]

### 7) سه کارمند با بیشترین تعداد سفارش

In [27]:
%%sql
select employees.first_name, employees.last_name, count(orders.order_id) as order_count
from employees
INNER JOIN orders
ON employees.employee_id = orders.employee_id
group by employees.employee_id
order by order_count desc
limit 3

 * postgresql://ali:***@localhost/Northwind
3 rows affected.

[('Margaret', 'Peacock', 156),
 ('Janet', 'Leverling', 127),
 ('Nancy', 'Davolio', 123)]

In [49]:
%%sql
select categories.category_name
from categories
INNER JOIN products
ON categories.category_id = products.category_id
INNER JOIN order_details
ON products.product_id = order_details.product_id
INNER JOIN orders
ON order_details.order_id = orders.order_id
where orders.ship_country = 'Germany'
group by categories.category_name

 * postgresql://ali:***@localhost/Northwind
8 rows affected.

[('Beverages',),
 ('Produce',),
 ('Condiments',),
 ('Grains/Cereals',),
 ('Meat/Poultry',),
 ('Dairy Products',),
 ('Confections',),
 ('Seafood',)]

همان طور که مشاهده میشود ۸ دسته محصولات به آلمان ارسال شده اند بنابراین طبق کوئری پایین هیچ دسته محصولی وجود ندارد که به آلمان ارسال نشده باشد.

In [ ]:
%%sql
select categories.category_name
from categories
where categories.category_id not in (
select categories.category_id
from categories
INNER JOIN products
ON categories.category_id = products.category_id
INNER JOIN order_details
ON products.product_id = order_details.product_id
INNER JOIN orders
ON order_details.order_id = orders.order_id
where orders.ship_country = 'Germany'
group by categories.category_id)

### 9) انتقال کارکنان

In [53]:
%%sql
select employees.first_name, employees.last_name, territories.territory_description
from employees
INNER JOIN employee_territories
ON employees.employee_id = employee_territories.employee_id
INNER JOIN territories
ON employee_territories.territory_id = territories.territory_id
where territories.territory_description in ('Orlando', 'Chicago', 'New York')

 * postgresql://ali:***@localhost/Northwind
4 rows affected.

[('Janet', 'Leverling', 'Orlando'),
 ('Steven', 'Buchanan', 'New York'),
 ('Steven', 'Buchanan', 'New York'),
 ('Robert', 'King', 'Chicago')]

 کارکنان بالا در این دو منطقه مشغول به فعالیت در این سه منطقه هستند که دوتای غیر نیویورک باید به نیویورک تبدیل شوند.

In [60]:
%%sql
update employee_territories
set territory_id = (select territory_id from territories where territory_description = 'New York' limit 1)
where territory_id in (select territory_id from territories where territory_description in ('Orlando', 'Chicago'))

 * postgresql://ali:***@localhost/Northwind
2 rows affected.

[]

در نهایت نتیجه کوئری قبل در زیر نشان میدهد که کارکنان به نیویورک انتقال یافته اند.

In [61]:
%%sql
select employees.first_name, employees.last_name, territories.territory_description
from employees
INNER JOIN employee_territories
ON employees.employee_id = employee_territories.employee_id
INNER JOIN territories
ON employee_territories.territory_id = territories.territory_id
where territories.territory_description in ('Orlando', 'Chicago', 'New York')

 * postgresql://ali:***@localhost/Northwind
4 rows affected.

[('Janet', 'Leverling', 'New York'),
 ('Steven', 'Buchanan', 'New York'),
 ('Steven', 'Buchanan', 'New York'),
 ('Robert', 'King', 'New York')]

### 10) افزایش قیمت ۱۵ درصدی محصولات لبنی

قبل از به روز رسانی قیمت ۱۰ محصول گران لبنی را میبینیم

In [68]:
%%sql
select products.product_name, categories.category_name, unit_price
from products
INNER JOIN categories
ON products.category_id = categories.category_id
where categories.category_name = 'Dairy Products'
order by unit_price desc

 * postgresql://ali:***@localhost/Northwind
10 rows affected.

[('Raclette Courdavault', 'Dairy Products', 55.0),
 ('Queso Manchego La Pastora', 'Dairy Products', 38.0),
 ('Gudbrandsdalsost', 'Dairy Products', 36.0),
 ('Mozzarella di Giovanni', 'Dairy Products', 34.8),
 ('Camembert Pierrot', 'Dairy Products', 34.0),
 ('Mascarpone Fabioli', 'Dairy Products', 32.0),
 ('Flotemysost', 'Dairy Products', 21.5),
 ('Queso Cabrales', 'Dairy Products', 21.0),
 ('Gorgonzola Telino', 'Dairy Products', 12.5),
 ('Geitost', 'Dairy Products', 2.5)]

In [70]:
%%sql
update products
set unit_price = unit_price * 1.15
where category_id = (select category_id from categories where category_name = 'Dairy Products')

 * postgresql://ali:***@localhost/Northwind
10 rows affected.

[]

با انجام به روز رسانی مشاهده میشود که قیمت های این دسته ۱۵ درصد افزایش یافته است.

In [71]:
%%sql
select products.product_name, categories.category_name, unit_price
from products
INNER JOIN categories
ON products.category_id = categories.category_id
where categories.category_name = 'Dairy Products'
order by unit_price desc

 * postgresql://ali:***@localhost/Northwind
10 rows affected.

[('Raclette Courdavault', 'Dairy Products', 63.25),
 ('Queso Manchego La Pastora', 'Dairy Products', 43.7),
 ('Gudbrandsdalsost', 'Dairy Products', 41.4),
 ('Mozzarella di Giovanni', 'Dairy Products', 40.02),
 ('Camembert Pierrot', 'Dairy Products', 39.1),
 ('Mascarpone Fabioli', 'Dairy Products', 36.8),
 ('Flotemysost', 'Dairy Products', 24.725),
 ('Queso Cabrales', 'Dairy Products', 24.15),
 ('Gorgonzola Telino', 'Dairy Products', 14.375),
 ('Geitost', 'Dairy Products', 2.875)]

### 11) افزایش قیمت ۱۰ درصدی محصولات شرکت گفته شده

قیمت ۱۰ محصول گران این شرکت قبل از به روزرسانی

In [84]:
%%sql
select products.product_name, suppliers.company_name, suppliers.contact_name, products.unit_price, units_in_stock
from products
INNER JOIN suppliers
ON products.supplier_id = suppliers.supplier_id
where suppliers.company_name = 'Mayumi''s'

 * postgresql://ali:***@localhost/Northwind
3 rows affected.

[('Konbu', "Mayumi's", 'Mayumi Ohno', 5.94, 24),
 ('Tofu', "Mayumi's", 'Mayumi Ohno', 23.0175, 35),
 ('Genen Shouyu', "Mayumi's", 'Mayumi Ohno', 12.87, 39)]

In [87]:
%%sql
update products
set unit_price = unit_price * 1.1
where supplier_id = (select supplier_id from suppliers where company_name = 'Mayumi''s')

 * postgresql://ali:***@localhost/Northwind
3 rows affected.

[]

### اضافه کردن ۱۵ محصول به انبار

In [88]:
%%sql
update products
set units_in_stock = units_in_stock + 15
where supplier_id = (select supplier_id from suppliers where company_name = 'Mayumi''s')

 * postgresql://ali:***@localhost/Northwind
3 rows affected.

[]

بعد از به روزرسانی

In [91]:
%%sql
select products.product_name, suppliers.company_name, suppliers.contact_name, products.unit_price, products.units_in_stock
from products
INNER JOIN suppliers
ON products.supplier_id = suppliers.supplier_id
where suppliers.company_name = 'Mayumi''s'

 * postgresql://ali:***@localhost/Northwind
3 rows affected.

[('Konbu', "Mayumi's", 'Mayumi Ohno', 6.534, 39),
 ('Tofu', "Mayumi's", 'Mayumi Ohno', 25.31925, 50),
 ('Genen Shouyu', "Mayumi's", 'Mayumi Ohno', 14.157, 54)]